Revit 2027 API
BuiltInFailures.FamilyFailures.DeletingBadFamTypeDumped Property
 Can't make type "[Family Name]". It will be deleted. Failing family has been saved to "[File Name]"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingBadFamTypeDumped { get; }
Public Shared ReadOnly Property DeletingBadFamTypeDumped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingBadFamTypeDumped {
	FailureDefinitionId^ get ();
}
static member DeletingBadFamTypeDumped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace